In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame({"age" :[22,3,6,4,2,57]})

In [5]:
df

   age
0   22
1    3
2    6
3    4
4    2
5   57

In [11]:
def func(x):
 return x*x

In [12]:
df.apply(func, axis=0)

    age
0   484
1     9
2    36
3    16
4     4
5  3249

In [23]:

df = pd.DataFrame({
    'col_a': ['one two six', 'three four five'],
    
})

# Function to split a string and return a list of words
def split_text(row):
    return row['col_a'].split()

# Applying with result_type='expand'
df_expanded = df.apply(split_text, axis=1, result_type='expand')

In [24]:
df_expanded

0        [one, two, six]
1    [three, four, five]
dtype: object

In [25]:
df_expanded = df.apply(split_text, axis=1)

In [26]:
print(df_expanded)

0        [one, two, six]
1    [three, four, five]
dtype: object

In [27]:
df_expanded = df.apply(split_text, axis=1, result_type='expand')

In [28]:
df_expanded

       0     1     2
0    one   two   six
1  three  four  five

In [30]:
df_expanded = df.apply(split_text, axis=1, result_type='reduce')

In [31]:
df_expanded

0        [one, two, six]
1    [three, four, five]
dtype: object

In [33]:
df_expanded = df.apply(split_text, axis=1, result_type='reduce')

In [45]:
df=pd.DataFrame({"age" :[22,3,6,4,2,57]})

In [46]:
df

   age
0   22
1    3
2    6
3    4
4    2
5   57

In [39]:
df.apply(lambda x : x**2)

    age
0   484
1     9
2    36
3    16
4     4
5  3249

In [48]:
df['age'].map(lambda x:x* 2)

0     44
1      6
2     12
3      8
4      4
5    114
Name: age, dtype: int64